{
  "destinations": [
    {
      "id": 1,
      "name": "Paris",
      "slug": "paris-fr",
      "description": "Experience the romance and charm of Paris, the city of lights, with its iconic landmarks, world-class cuisine, and vibrant culture.",
      "images": ["/paris-fr.png", "/paris-fr-2.png", "/paris-fr-3.png"],
      "heroImage": "/paris-hero.png",
      "price": 599,
      "originalPrice": 599,
      "discountedPrice": 599,
      "discountPercent": 0,
      "includedServices": [
        "Accommodation in a 4-star hotel",
        "Daily breakfast",
        "Guided city tour",
        "Seine River cruise",
        "Airport transfers"
      ],
      "longDescription": "Paris, the capital city of France, is renowned for its art, fashion, gastronomy, and culture. Visitors can explore iconic landmarks such as the Eiffel Tower, Louvre Museum, and Notre-Dame Cathedral. The city's charming neighborhoods, like Montmartre and Le Marais, offer a glimpse into Parisian life. Enjoy world-class dining at Michelin-starred restaurants or relax at a sidewalk café while people-watching. Paris is also famous for its shopping districts, including the Champs-Élysées and Galeries Lafayette. Whether you're interested in history, art, or simply soaking in the atmosphere, Paris has something for everyone.",
      "tips": [
        "Book tickets to the Eiffel Tower in advance to avoid long lines.",
        "Explore the Louvre Museum early in the morning for a more peaceful experience.",
        "Take a Seine River cruise at sunset for stunning views of the city."
      ],
      "attractions": [
        {
          "id": 1,
          "name": "Louvre Museum",
          "imageUrl": "/attractions-fr-1.png",
          "details": "The Louvre Museum is the world's largest art museum and a historic monument in Paris, France. It is home to thousands of works of art, including the Mona Lisa and the Venus de Milo."
        },
        {
          "id": 2,
          "name": "Siene River Cruise",
          "imageUrl": "/attractions-fr-2.png",
          "details": "A Seine River cruise offers a unique perspective of Paris, allowing visitors to see iconic landmarks such as the Eiffel Tower, Notre-Dame Cathedral, and the Louvre from the water."
        },
        {
          "id": 3,
          "name": "Rue Du Croissant",
          "imageUrl": "/attractions-fr-3.png",
          "details": "Rue Du Croissant is a charming street in Paris known for its quaint cafes and bakeries, where visitors can enjoy authentic French pastries and coffee."
        },
        {
          "id": 4,
          "name": "Parc Des Prince",
          "imageUrl": "/attractions-fr-4.png",
          "details": "Parc Des Prince is a famous football stadium in Paris, home to the Paris Saint-Germain Football Club. It hosts various sporting events and concerts throughout the year."
        }
      ]
    },
    {
      "id": 2,
      "name": "Santoniri",
      "slug": "santorini-gr",
      "description": "Discover the breathtaking beauty of Santorini, Greece, with its stunning sunsets",
      "images": ["/santorini-gr-1.png", "/santorini-gr-2.png", "/santorini-gr-3.png"],
      "heroImage": "/santorini-hero.png",
      "price": 999,
      "originalPrice": 1799,
      "discountedPrice": 999,
      "discountPercent": 44,
      "includedServices": [
        "Accommodation in a cliffside villa",
        "Daily breakfast with a view",
        "Sunset cruise",
        "Wine tasting tour",
        "Airport transfers"
      ],
      "longDescription": "Santorini, a picturesque island in the Aegean Sea, is famous for its stunning sunsets, white-washed buildings, and crystal-clear waters. Visitors can explore charming villages like Oia and Fira, relax on unique volcanic beaches, and indulge in delicious Greek cuisine. The island also offers opportunities for hiking, wine tasting, and boat tours to nearby islands. Santorini's rich history is evident in its archaeological sites, such as Akrotiri, an ancient Minoan city preserved in volcanic ash. Whether you're seeking romance, adventure, or relaxation, Santorini is a perfect destination.",
      "tips": [
        "Visit Oia for the best sunset views.",
        "Rent a car or ATV to explore the island at your own pace.",
        "Try local wines at a vineyard tour."
      ],
      "attractions": [
        {
          "id": 1,
          "name": "Oia Village",
          "imageUrl": "/attractions-gr-1.png",
          "details": "Oia Village is a picturesque town on the island of Santorini, known for its stunning sunsets, white-washed buildings, and blue-domed churches. It is a popular destination for tourists seeking breathtaking views and charming streets to explore."
        },
        {
          "id": 2,
          "name": "Red Beach",
          "imageUrl": "/attractions-gr-2.png",
          "details": "Red Beach is a unique beach on the island of Santorini, famous for its striking red volcanic sand and cliffs. It offers crystal-clear waters for swimming and snorkeling, making it a popular spot for visitors looking to experience the island's natural beauty."
        },
        {
          "id": 3,
          "name": "Ancient Akrotiri",
          "imageUrl": "/attractions-gr-3.png",
          "details": "Ancient Akrotiri is a well-preserved archaeological site on the island of Santorini, showcasing the remains of a Minoan Bronze Age settlement that was buried by a volcanic eruption. Visitors can explore the ruins and learn about the history and culture of this ancient civilization."
        },
        {
          "id": 4,
          "name": "Santorini Caldera",
          "imageUrl": "/attractions-gr-4.png",
          "details": "The Santorini Caldera is a large volcanic crater formed by a massive eruption thousands of years ago. It is surrounded by steep cliffs and offers stunning views of the Aegean Sea, making it a popular destination for boat tours and sightseeing."
        }
      ]
    }
  ],
  "top-destinations": [
    {
      "id": 1,
      "title": "Paris",
      "price": 599,
      "imageUrl": "/paris.png",
      "slug": "paris-fr"
    },
    {
      "id": 2,
      "title": "New York",
      "price": 299,
      "imageUrl": "/ny.png",
      "slug": "new-york-usa"
    },
    {
      "id": 3,
      "title": "Tokyo",
      "price": 599,
      "imageUrl": "/tokyo.png",
      "slug": "tokyo-japan"
    },
    {
      "id": 4,
      "title": "Hawaii",
      "price": 399,
      "imageUrl": "/hawaii.png",
      "slug": "hawaii-usa"
    }
  ],
  "testimonials": [
    {
      "id": 1,
      "name": "Sarah Miller",
      "image": "/traveler-3.png",
      "location": "New York, USA",
      "message": "TravelGo made planning my trip incredibly easy. Everything was smooth from booking to checkout.",
      "rating": 5
    },
    {
      "id": 2,
      "name": "Lucas Pereira",
      "image": "/traveler-1.png",
      "location": "São Paulo, Brazil",
      "message": "Great destinations and amazing deals. The interface is clean and very intuitive.",
      "rating": 5
    },
    {
      "id": 3,
      "name": "Emma Johnson",
      "image": "/traveler-2.png",
      "location": "London, UK",
      "message": "I loved how fast and simple it was to book my vacation. Highly recommended!",
      "rating": 4
    }
  ],
  "best-deals": [
    {
      "id": 1,
      "city": "Santorini, Greece",
      "image": "/best-deal-1.png",
      "originalPrice": 1799,
      "discountedPrice": 999,
      "discountPercent": 44,
      "slug": "santorini-gr"
    },
    {
      "id": 2,
      "city": "Maldives",
      "image": "/best-deal-2.png",
      "originalPrice": 2499,
      "discountedPrice": 1499,
      "discountPercent": 40,
      "slug": "maldives"
    },
    {
      "id": 3,
      "city": "Wien, Austria",
      "image": "/best-deal-3.png",
      "originalPrice": 1399,
      "discountedPrice": 899,
      "discountPercent": 36,
      "slug": "wien-austria"
    }

  ]
}